//TODO: jQuery
// Изучите все основные функции jQuery, в том числе сделайте свой веб-сайт более интерактивным, создайте эффекты и анимацию, обработайте события и многое другое!

//TODO: What is jQuery (Что такое jQuery)
// jQuery — это быстрая, небольшая и многофункциональная библиотека JavaScript.
// Это значительно упрощает такие вещи, как обход и манипулирование документами HTML, обработку событий и анимацию. Все возможности jQuery доступны через JavaScript, поэтому для понимания, структурирования и отладки кода необходимо хорошо разбираться в JavaScript.
// Если вы хотите изучить JavaScript, ознакомьтесь с нашим бесплатным учебным пособием по JavaScript.

//TODO: What is jQuery (Что такое jQuery)
// Во-первых, давайте рассмотрим пример манипуляции с HTML с помощью JavaScript.
// Чтобы получить элемент с id="start" и изменить его html на "Go", нам нужно будет сделать следующее:
// var el = document.getElementById("start");
// el.innerHTML = "Go";
// Чтобы проделать те же манипуляции с jQuery, нам понадобится всего одна строка кода:
// $("#start").html("Go");
// Вы узнаете о новом синтаксисе в следующих уроках, но, как видите, код намного короче и понятнее.
// Еще одним большим преимуществом jQuery является то, что вам не нужно беспокоиться о поддержке браузера, ваш код будет работать одинаково во всех основных браузерах, включая Internet Explorer 6!
