//TODO: Introduction to JavaScript
//TODO: Введение в JavaScript
//Вы когда-нибудь хотели сделать веб-сайты интерактивными, создавать забавные мобильные приложения
//или работать с искусственным интеллектом? JavaScript позволяет вам делать все это!
//Неудивительно, что это один из самых популярных языков программирования.
//Этот курс идеально подходит для начинающих — опыт программирования не требуется.
//К концу этого курса вы будете знать основы использования JavaScript для создания интерактивного веб-сайта.

//TODO: Welcome to JavaScript! (Добро пожаловать в JavaScript!)
//Вы когда-нибудь посещали веб-сайт, который заставлял вас думать…
//«Эй, этот веб-сайт действительно классный и интерактивный»? Ну, JavaScript, вероятно, сделал это возможным....
//В этом курсе мы изучим основные концепции JavaScript — одного из самых популярных языков программирования,
//который делает веб-сайты динамичными и интерактивными.
//С помощью JavaScript вы также можете создавать мобильные приложения и игры, обрабатывать данные и многое другое!

//TODO: Output (Выход)
//Давайте начнем с создания программы, которая отображает «Hello World!». на консоль с помощью console.log()функции.
//Консоль является частью веб-браузера и позволяет вам регистрировать сообщения,
//запускать код JavaScript и просматривать ошибки и предупреждения.
console.log("Hello World!");
